{
    "locales": {
        "en": {
            "title": "Experience",
            "title_long_prefix": "Summary of my",
            "title_long": "**Work** Experience"
        },

        "es": {
            "title": "Experiencia",
            "title_long_prefix": "Resumen de mi",
            "title_long": "Experiencia **Laboral**"
        },

        "fr": {
            "title": "Expérience",
            "title_long_prefix": "Résumé de mon",
            "title_long": "Parcours **Professionel**"
        }
    },

    "articles": [
        {
            "id": "work",
            "component": "ArticleTimeline",
            "config": {},
            "locales": {},

            "items": [
                {
                    "icon": {
                        "img": "images/pictures/place-7.png",
                        "fa": "",
                        "faColors": {"bg": null, "fill": null}
                    },
                    "dates": {
                        "start": "05/01/2018",
                        "end": "07/01/2020"
                    },
                    "locales": {
                        "en": {
                            "title": "**Credit Suisse**",
                            "info": "Sapphire Studio",
                            "text": "Architected ML models for AML transaction monitoring that reduced false positives by 80% achieving regulatory approval for deployment. Oversaw rigorous internal validation, ensuring models met performance and compliance standards.",
                            "tags": []
                        },
                        "es": {
                            "title": "Desarrollador **Backend**",
                            "info": "Sapphire Studio",
                            "text": "Diseñé la arquitectura de modelos de aprendizaje automático (ML) para la monitorización de transacciones AML, lo que redujo los falsos positivos en un 80% y logró la aprobación regulatoria para su implementación. Supervisé una rigurosa validación interna, asegurando que los modelos cumplieran con los estándares de rendimiento y cumplimiento normativo.",
                            "tags": []
                        },
                        "fr": {
                            "title": "Développeur **Backend**",
                            "info": "Sapphire Studio",
                            "text": "J’ai conçu l’architecture de modèles d’apprentissage automatique (ML) pour la surveillance des transactions AML, ce qui a réduit les faux positifs de 80 % et a permis d’obtenir l’approbation réglementaire pour le déploiement. J’ai supervisé une validation interne rigoureuse, garantissant que les modèles répondaient aux normes de performance et de conformité.",
                            "tags": []
                        }
                    }
                },
                {
                    "icon": {
                        "img": "images/pictures/place-3.png",
                        "fa": "",
                        "faColors": {"bg": null, "fill": null}
                    },
                    "dates": {
                        "start": "03/01/2020",
                        "end": "11/01/2021"
                    },
                    "locales": {
                        "en": {
                            "title": "**Softwin**",
                            "info": "Coursera",
                            "text": "Contrib uted to a natural language processing (NLP) project. Developed algorithms and data structures used for language translations. Researched innovative NLP algorithms and developed and integrated them with the product. Took part in the screening process as a technical screener.",
                            "tags": []
                        },
                        "es": {
                            "title": "Ingeniero **Full-Stack**",
                            "info": "Coursera",
                            "text": "Contribuí a un proyecto de procesamiento del lenguaje natural (PLN). Desarrollé algoritmos y estructuras de datos utilizados para traducciones de idiomas. Investigué algoritmos innovadores de PLN y los desarrollé e integré con el producto. Participé en el proceso de selección como evaluador técnico.",
                            "tags": []
                        },
                        "fr": {
                            "title": "Ingénieur **Full-Stack**",
                            "info": "Coursera",
                            "text": "J’ai contribué à un projet de traitement du langage naturel (TLN). J’ai développé des algorithmes et des structures de données utilisés pour les traductions linguistiques. J’ai recherché des algorithmes de TLN innovants et je les ai développés et intégrés au produit. J’ai participé au processus de sélection en tant qu’évaluateur technique.",
                            "tags": []
                        }
                    }
                },
                {
                    "icon": {
                        "img": "images/pictures/place-1.png",
                        "fa": "",
                        "faColors": {"bg": null, "fill": null}
                    },
                    "dates": {
                        "start": "12/01/2021",
                        "end": "09/01/2024"
                    },
                    "locales": {
                        "en": {
                            "title": "**QuantDEFI**",
                            "info": "Adobe Inc.",
                            "text": "Used Jakarta EE to create the back end for the CrowdStrike mobile app. Covered more than 90% of the code with Unit, Integration, and E2E tests.",
                            "tags": []
                        },
                        "es": {
                            "title": "**QuantDEFI**",
                            "info": "Adobe Inc.",
                            "text": "Utilicé Jakarta EE para crear el back end de la aplicación móvil de CrowdStrike. Cubrí más del 90% del código con pruebas unitarias, de integración y de extremo a extremo (E2E).",
                            "tags": []
                        },
                        "fr": {
                            "title": "**QuantDEFI**",
                            "info": "Adobe Inc.",
                            "text": "J’ai utilisé Jakarta EE pour créer l’arrière-plan (ou back-end) de l’application mobile CrowdStrike. J’ai couvert plus de 90 % du code avec des tests unitaires, d’intégration et de bout en bout (E2E).",
                            "tags": []
                        }
                    }
                },
                {
                    "icon": {
                        "img": null,
                        "fa": "fa-brands fa-apple",
                        "faColors": {"bg": "#111", "fill": "#EEE"}
                    },
                    "dates": {
                        "start": "08/01/2024",
                        "end": "09/01/2025"
                    },
                    "locales": {
                        "en": {
                            "title": "**Self-Employed**",
                            "info": "Apple Inc.",
                            "text": "Worked as a freelance senior full-stack developer for several large scale and startup apps as a member of agile teams or as an individual contributor.",
                            "tags": []
                        },
                        "es": {
                            "title": "Desarrollador **Backend Senior**",
                            "info": "Apple Inc.",
                            "text": "Trabajé como desarrollador senior full-stack independiente para varias aplicaciones a gran escala y startups, ya sea como miembro de equipos ágiles o como colaborador individual.",
                            "tags": []
                        },
                        "fr": {
                            "title": "Développeur **Backend Senior**",
                            "info": "Apple Inc.",
                            "text": "J’ai travaillé comme développeur full-stack senior en freelance pour plusieurs applications à grande échelle et des startups, en tant que membre d’équipes agiles ou en tant que contributeur individuel.",
                            "tags": []
                        }
                    }
                }
            ]
        }
    ]
}
